---
kind: type
id: T:Autodesk.Revit.DB.DetailArc
source: html/ad7e2725-61aa-c003-3be5-bfa6f3717f9c.htm
---
# Autodesk.Revit.DB.DetailArc

Represents a DetailArc within Autodesk Revit.

## Syntax (C#)
```csharp
public class DetailArc : DetailCurve
```

## Remarks
Currently it's just a place holder for specific type.
All the geometry-related functionality is provided by geometry curve object from
DetailCurve::geometryCurve property.